local guild_pos = { 
										["GuildPos_Name0"] = "Рядовые",
										["GuildPos_Name1"] = "Элита",
										["GuildPos_Name2"] = "Глава",
										["GuildPos_Name3"] = "Заместитель",
										["GuildPos_Name4"] = "Авангард",
										--["GuildPos_Name5"] = "Хранитель",
										--["GuildPos_Name00"] = "Помошник",
										--["GuildPos_Name01"] = "Мастер",
										--["GuildPos_Name02"] = "Рекрутер",
										--["GuildPos_Name10"] = "Рабочий усадьбы",
										--["GuildPos_Name11"] = "Мастер усадьбы",
										--["GuildPos_Name12"] = "Рекрутер усадьбы",
										--["GuildPos_Name20"] = "Белый тигр",
										--["GuildPos_Name21"] = "Мастер Белых тигров",
										--["GuildPos_Name22"] = "Рекрутер Белых тигров",
										--["GuildPos_Name30"] = "Работник Храма",
										--["GuildPos_Name31"] = "Мастер Храма",
										--["GuildPos_Name32"] = "Рекрутер Храма"
									}
									
local guildpos_tips = {
	["GuildPos_Name0"] = "Обычный член гильдии может воспользоваться правом учить навыки гильдии и брать гильдейские задания.",
	["GuildPos_Name1"] = "Элита, авангард, глава гильдии и его заместитель могут отдавать приказы, а так же могут воспользоваться правом учить навыки гильдии и брать гильдейские задания.",
	["GuildPos_Name2"] = "Глава гильдии обладает максимальными возможностями, может назначать на должности, выдавать права на пользование складом гильдии, а так же определять направления исследуемых навыков.",
	["GuildPos_Name3"] = "Заместители главы гильдии назначаюся самим главой, всего в гильдии может быть не более 3 заместителей.",
	["GuildPos_Name4"] = "Авангард может набирать и приглашать других игроков вступить в гильдию.",
	--["GuildPos_Name5"] = "Звание занимают только женщины в гильдии.",
	--["GuildPos_Name00"] = "青龙堂乃是帮派中专责资材筹集的堂口,其成员可在帮派管事处接取[筹集资材]任务,青龙堂主为青龙堂的管理者,拥有青龙堂全部功能权限。",
	--["GuildPos_Name01"] = "青龙堂乃是帮派中专责资材筹集的堂口,其成员可在帮派管事处接取[筹集资材]任务,青龙香主乃是堂主的左膀右臂,协助堂主管理青龙堂。",
	--["GuildPos_Name02"] = "青龙堂乃是帮派中专责资材筹集的堂口,其成员可在帮派管事处接取[筹集资材]任务,青龙帮众乃是青龙堂普通成员,可在堂主和香主的带领下参与青龙堂功能。",
	--["GuildPos_Name10"] = "朱雀堂乃是帮派中专责筹措资金的堂口,其成员可在帮派管事处进行[跑商],朱雀堂主为朱雀堂的管理者,拥有朱雀堂全部功能权限。",
	--["GuildPos_Name11"] = "朱雀堂乃是帮派中专责筹措资金的堂口,其成员可在帮派管事处进行[跑商],朱雀香主乃是堂主的左膀右臂,协助堂主管理朱雀堂。",
	--["GuildPos_Name12"] = "朱雀堂乃是帮派中专责筹措资金的堂口,其成员可在帮派管事处进行[跑商],朱雀帮众乃是朱雀堂普通成员,可在堂主和香主的带领下参与朱雀堂功能。",
	--["GuildPos_Name20"] = "白虎堂乃是帮派中专责维护帮派安定的堂口,其成员可在帮派管事处接取[维护安定]任务,白虎堂主为白虎堂的管理者,拥有白虎堂全部功能权限。",
	--["GuildPos_Name21"] = "白虎堂乃是帮派中专责维护帮派安定的堂口,其成员可在帮派管事处接取[维护安定]任务,白虎香主乃是堂主的左膀右臂,协助堂主管理白虎堂。",
	--["GuildPos_Name22"] = "白虎堂乃是帮派中专责维护帮派安定的堂口,其成员可在帮派管事处接取[维护安定]任务,白虎帮众乃是白虎堂普通成员,可在堂主和香主的带领下参与白虎堂功能",
	--["GuildPos_Name30"] = "玄武堂乃是帮派中专责帮派设施建设的堂口,其成员可在帮派管事处进行[升级设施],玄武堂主为玄武堂的管理者,拥有玄武堂全部功能权限。",
	--["GuildPos_Name31"] = "玄武堂乃是帮派中专责帮派设施建设的堂口,其成员可在帮派管事处进行[升级设施],玄武香主乃是堂主的左膀右臂,协助堂主管理玄武堂。",
	--["GuildPos_Name32"] = "玄武堂乃是帮派中专责帮派设施建设的堂口,其成员可在帮派管事处进行[升级设施],玄武帮众乃是玄武堂普通成员,可在堂主和香主的带领下参与玄武堂功能"
	}
											
function GetStringTips(szName,szPos)

	local pos = "<font=Arial,0,20,20>" .. guild_pos[szName] .. guild_pos[szPos]
	
	local tips = "<font=Arial,0,16,20><color=0xffffffff>" .. guildpos_tips[pos]
	
	local newPos = "<color=0xff00ff00>" .. pos .. "\\n"

	newPos = newPos .. tips
	
	return newPos
end

function GetStringTips(szName)

  local pos = "<font=Arial,0,20,20>" .. guild_pos[szName]

	local tips = "<font=Arial,0,16,20><color=0xffffffff>" .. guildpos_tips[szName]
	
	local newPos = "<color=0xff00ff00>" .. pos .. "\\n"

	newPos = newPos .. tips
	
	return newPos
end

